meeting/agenda/2022/11-08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 010 Agenda 2022-11-08</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 010 Agenda 2022-11-08</h1>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EST).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>

<p>
Reminder: several regular members of the CG will be attending
Declarative Amsterdam on 8 November. This meeting will focus on XSLT
issues.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets BTW, NW, JL, and CG. MSM to chair.
</p>
</div>
</div>

<div id="outline-container-h-D8BAA332-74D3-46FE-A439-68B7A50D8E88" class="outline-3">
<h3 id="h-D8BAA332-74D3-46FE-A439-68B7A50D8E88"><span class="section-number-3">1.2.</span> Select a scribe</h3>
<div class="outline-text-3" id="text-h-D8BAA332-74D3-46FE-A439-68B7A50D8E88">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.3.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
Regrets for the next meeting?
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.5.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2022/11-01.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.6.</span> Review of  open action items <code>[2/6]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-007-05: NW to make an issue for Martin’s proposed ammendment to map:build</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-01: NW to coordinate with MK on an agenda for next week.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-02: NW to work with MK to make sure PR #197 is updated correctly</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-03: NW to investigate the relationship between PR #215 and <code>resolve-uri</code>.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-04: NW to review RFC 3896 wrt relative URIs</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-05: NW to fix the return type for <code>parse-uri</code>; consider using a record type.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-06: NW to add error tests for <code>parse-uri</code>.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-009-06: NW to make the query segments an array of maps.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-h-57495EC0-C9D5-4F9E-BD59-B37E64D9B019" class="outline-3">
<h3 id="h-57495EC0-C9D5-4F9E-BD59-B37E64D9B019"><span class="section-number-3">2.1.</span> Extensions to conditional instructions</h3>
<div class="outline-text-3" id="text-h-57495EC0-C9D5-4F9E-BD59-B37E64D9B019">
<p>
Approve extensions to conditional instructions described in <a href="https://qt4cg.org/specifications/xslt-40/Overview-diff.html#conditionals">chapter 8</a>
of the current draft.
</p>

<ol class="org-ol">
<li><code>xsl:if</code>: <code>@then</code> and <code>@else</code> attributes</li>
<li><code>xsl:when</code> and <code>xsl:otherwise</code>: <code>@select</code> attribute</li>
<li><code>xsl:switch</code> instruction</li>
</ol>
</div>
</div>

<div id="outline-container-h-249B03E7-22EA-4F3A-A6D6-A801BE8DB1C8" class="outline-3">
<h3 id="h-249B03E7-22EA-4F3A-A6D6-A801BE8DB1C8"><span class="section-number-3">2.2.</span> Changes to modes</h3>
<div class="outline-text-3" id="text-h-249B03E7-22EA-4F3A-A6D6-A801BE8DB1C8">
<p>
Review changes to modes in <a href="https://qt4cg.org/specifications/xslt-40/Overview-diff.html#modes">§6.7</a>:
</p>

<ol class="org-ol">
<li><code>as</code> attribute (detail is in <a href="https://qt4cg.org/specifications/xslt-40/Overview-diff.html#mode-result-type">§6.7.4</a>)</li>
<li>enclosed modes (detail is in <a href="https://qt4cg.org/specifications/xslt-40/Overview-diff.html#enclosed-modes">§6.7.5</a>)</li>
</ol>
</div>
</div>

<div id="outline-container-h-08341AFB-91D3-49F4-976D-C5EA8A383216" class="outline-3">
<h3 id="h-08341AFB-91D3-49F4-976D-C5EA8A383216"><span class="section-number-3">2.3.</span> Review array construction</h3>
<div class="outline-text-3" id="text-h-08341AFB-91D3-49F4-976D-C5EA8A383216">
<p>
See <a href="https://qt4cg.org/specifications/xslt-40/Overview-diff.html#array-construction">§22.1</a>.
</p>

<p>
MK says:
</p>

<blockquote>
<p>
I don't think the text here is ready for approval; it needs open
discussion of the technical issues to make progress. The key question
is, what kind of value should xsl:array-member produce? This also
relates to how we iterate over arrays and maps.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
